artilleryConfigs/100UsersPOST.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 1
    - duration: 300
      arrivalRate: 5
    - duration: 600
      arrivalRate: 10
      rampTo: 20
      maxVusers: 100
  processor: "./payload-generator/generateDataToPost.js"

scenarios:
  - name: "Post a new review"
    flow:
      # call generateRandomData() to create the name, email, and password variables
      - function: "generateData"
      - post:
          url: "/api/create/{{ id_game }}"
          json:
            num_comments: "{{ num_comments }}"
            num_found_funny: "{{ num_found_funny}}"
            num_found_helpful: "{{ num_found_helpful }}"
            hours_at_review_time: "{{ hours_at_review_time }}"
            hours_on_record: "{{ hours_on_record }}"
            is_recommended: "{{ is_recommended }}"
            purchase_type: "{{ purchase_type }}"
            date_posted: "{{ date_posted }}"
            id_user: "{{ id_user }}"
            received_free: "{{ received_free }}"
            review_text: "{{ review_text }}"
      # Print the data we're sending while debugging the script:
      - log: "Sent a post request to /create/{{ id_game }}"