artilleryConfigs/DeployedStressTest.yml
config:
  target: "http://18.220.196.29:3001/api"
  phases:
    - duration: 60
      arrivalRate: 5
      name: 'warm up'
    # - duration: 600
    #   arrivalRate: 10
    #   rampTo: 1000
    #   name: Lets destroy server?
  processor: "./payload-generator/generateDataToPost.js"
scenarios:
  - name: "Get ALL reviews of game with"
    flow:
      - function: "generateData"
      - get:
          url: "/gamereviews/{{ id_game }}"
  - name: "Get positive & negative reviews & playtime constraints"
    flow:
      - function: "generateData"
      - get:
          url: "/gamereviews/{{ id_game }}?review_type=positive"
      - get:
          url: "/gamereviews/{{ id_game }}?review_type=negative"
      - get:
          url: "/gamereviews/{{ id_game }}?review_type=negative&play_max=25"
      - get:
          url: "/gamereviews/{{ id_game }}?review_type=positive&play_max=100"
  - name: "Post a new review"
    flow:
      - function: "generateData"
      - post:
          url: "/create/{{ id_game }}"
          json:
            num_comments: "{{ num_comments }}"
            num_found_funny: "{{ num_found_funny}}"
            num_found_helpful: "{{ num_found_helpful }}"
            hours_at_review_time: "{{ hours_at_review_time }}"
            hours_on_record: "{{ hours_on_record }}"
            is_recommended: "{{ is_recommended }}"
            purchase_type: "{{ purchase_type }}"
            date_posted: "{{ date_posted }}"
            id_user: "{{ id_user }}"
            received_free: "{{ received_free }}"
            review_text: "{{ review_text }}"